Repository: Daniel-KM/Omeka-S-module-Access
Catalog: language/*.po
Languages: fr

source: Set access level protected for all resources without status
fr: Définir le niveau d’accès protégé pour toutes les ressources sans statut

source: Set access level forbidden for all resources without status
fr: Définir le niveau d’accès interdit pour toutes les ressources sans statut

source: Set access level free when public and reserved when private
fr: Définir le niveau d’accès libre quand la ressource est publique et réservé lorsqu’elle est privée

source: Set access level free when public and protected when private
fr: Définir le niveau d’accès libre quand la ressource est publique et protégé lorsqu’elle est privée

source: Set access level free when public and forbidden when private
fr: Définir le niveau d’accès libre quand la ressource est publique et interdit lorsqu’elle est privée

source: Send email to admin and user or visitor on access request or update
fr: Envoyer un mail à l’administrateur et à l’utilisateur ou au visiteur lors des demandes d’accès ou des mises à jour

source: Admin email subject
fr: Sujet du mail admin

source: Message to admin for new request
fr: Message à l’admin pour une nouvelle demande

source: {main_title}, {main_url}, {site_title}, {site_url}, {email}, {name}, {message}, {resource} , {resources} and specific fields wrapped with "{}".
fr: {main_title}, {main_url}, {site_title}, {site_url}, {email}, {name}, {message}, {resource}, {resources} et les champs spécifiques entourés avec « {} ».

source: Message to admin for updated request
fr: Message à l’admin pour une demande mise à jour

source: User email subject
fr: Sujet du mail utilisateur

source: Message to user for new request
fr: Message à l’utilisateur pour une nouvelle demande

source: {main_title}, {main_url}, {site_title}, {site_url}, {email}, {name}, {message}, {resource}, {resources} and specific fields wrapped with "{}".
fr: {main_title}, {main_url}, {site_title}, {site_url}, {email}, {name}, {message}, {resource}, {resources} et les champs spécifiques entourés avec « {} ».

source: Message to user for request accepted
fr: Message à l’utilisateur pour une demande acceptée

source: Message to user for request rejected
fr: Message à l’utilisateur pour une demande rejetée

source: Visitor email subject
fr: Sujet du mail visiteur

source: Message to visitor for new request
fr: Message au visiteur pour une nouvelle demande

source: {main_title}, {main_url}, {site_title}, {site_url}, {email}, {name}, {message}, {resource}, {resources}, {session_url} and specific fields wrapped with "{}".
fr: {main_title}, {main_url}, {site_title}, {site_url}, {email}, {name}, {message}, {resource}, {resources}, {session_url} et les champs spécifiques entourés avec « {} ».

source: Message to visitor for request accepted
fr: Message au visiteur pour une demande acceptée

source: Message to visitor for request rejected
fr: Message au visiteur pour une demande rejetée

source: Message for the block "Access request text" when a resource is not available
fr: Message pour le bloc « Texte de demande d’accès » lorsqu’une ressource n’est pas disponible

source: File types to protect via .htaccess
fr: Types de fichiers à protéger via .htaccess

source: Select the file types that should be protected by an Apache rewrite rule in the root .htaccess. The rule redirects direct file access through the module Access controller, which checks access rights. When writable, the .htaccess is updated automatically; otherwise, the rule to copy is displayed.
fr: Choisissez les types de fichiers qui doivent être protégés par une règle de réécriture d'Apache dans le fichier racine .htaccess. La règle redirige l'accès direct aux fichiers via le contrôleur du module Access, qui vérifie les droits d'accès. Lorsqu’il est accessible en écriture, le .htaccess est mis à jour automatiquement ; dans le cas contraire, la règle à copier est affichée.

source: Custom file paths to protect via .htaccess
fr: Chemins d'accès personnalisés à protéger via .htaccess

source: Additional file subdirectories to protect, for example for the module DerivativeMedia (mp3, mp4, webm, ogg, pdf, etc.). Separate paths with spaces.
fr: Sous-répertoires de fichiers supplémentaires à protéger, par exemple pour le module DerivativeMedia (mp3, mp4, webm, ogg, pdf, etc.). Séparez les chemins d'accès par des espaces.

source: Protect media content only (files)
fr: Protéger uniquement le contenu multimédia (fichiers)

source: Protect records and content (not supported currently)
fr: Protéger les notices et le contenu (non pris en charge actuellement)

source: Access modes
fr: Modes d’accès

source: IP: visitors with specified ips have access to a list of reserved media by item sets
fr: IP : les visiteurs avec les ips indiquées auront un accès libre à tous les médias en accès réservé par collection

source: Guest: all users, included guests, have access to all reserved medias
fr: Invité : tous les utilisateurs, y compris les invités, ont accès à tous les médias réservés

source: External: users externally authenticated (cas, ldap, sso) have access to all reserved medias
fr: Externe : les utilisateurs authentifiés par un système tiers (cas, ldap, sso) ont accès à tous les médias réservés

source: CAS: users authenticated by cas have access to all reserved medias
fr: CAS : les utilisateurs authentifiés par cas ont accès à tous les médias réservés

source: LDAP: users authenticated by ldap have access to all reserved medias
fr: LDAP : les utilisateurs authentifiés par ldap ont accès à tous les médias réservés

source: SSO: users authenticated by sso have access to all reserved medias
fr: SSO : les utilisateurs authentifiés par sso ont accès à tous les médias réservés

source: SSO / IDP: users authenticated by specified identity providers have access to a list of reserved media by item sets
fr: SSO / IDP : utilisateurs authentifiés par les fournisseurs d’identité ont accès à une liste de médias réservés dans des collections

source: Users authenticated with a specific email have access to all reserved medias
fr: Les utilisateurs authentifiés avec une adresse mail spécifique ont accès à tous les médias en accès réservé

source: User: authenticated users should request access to specific reserved medias
fr: Utilisateur : les utilisateurs authentifiés doivent demander un accès pour chaque média réservé

source: Email: A visitor identified by email should request access to specific reserved medias
fr: Mail : les visiteurs identifiés par une adresse mail doivent demander un accès pour chaque média réservé

source: Token: A user or visitor with a token have access to specific reserved medias
fr: Jeton : un utilisateur ou un visiteur avec un jeton a accès à des médias réservés

source: List of ips with open access, eventually limited to selected item sets
fr: Liste des ips autorisant un libre accès, éventuellement limité à des collections

source: These ips will have unrestricted access to all resources or only resources of the specified item sets. List them separated by a "=", one by line. Range ip are allowed (formatted as cidr). An item set prepended with a "-" means an excluded item set, in particular when a global item set is defined to identify all reserved resources.
fr: Ces ips auront un accès libre à toutes les ressources ou aux seules ressources appartenant aux collections associées. Listez-les séparés par un « = », une par ligne. Les plages d’ip sont autorisées (formatées en cidr). Une collection préfixée avec un « - » indique une collection exclue, en particulier quand une collection est définie globalement pour les ressources réservées.

source: Check forwarded ip first (in proxy environment)
fr: Vérifier d’abord l’ip renvoyée (dans un environnement avec proxy)

source: List of sso idp with open access, eventually limited to selected item sets
fr: Liste des idps sso autorisant un libre accès, éventuellement limité à des collections

source: These identity providers will have unrestricted access to all resources or only resources of the specified item sets. List them separated by a "=", one by line. The idp name is the domain name or the value used in the login form. "federation" can be used for all users authenticated via a federated idp. An item set prepended with a "-" means an excluded item set, in particular when a global item set is defined to identify all reserved resources.
fr: Ces fournisseurs d’identité auront un accès libre à toutes les ressources ou aux seules ressources appartenant aux collections associées. Listez-les séparés par un « = », une par ligne. Le nom de l’idp est le nom de domaine ou la valeur définir dans le formulaire de connexion. « federation » permet de définir l’accès pour tous les utilisateurs authentifiés par une fédération d’idps. Une collection préfixée avec un « - » indique une collection exclue, en particulier quand une collection est définie globalement pour les ressources réservées.

source: Regex on email of users allowed to access reserved medias (option above)
fr: Regex sur l’adresse mail des utilisateurs autorisés à accéder aux médias réservés (option ci-dessus)

source: Set access level and embargo via a property
fr: Définir le niveau d’accès et l’embargo via une propriété

source: required
fr: requis

source: Set property when access uses property
fr: Définir la propriété lorsque l’accès utilise la propriété

source: Warning: a full reindexation is needed when changing the property.
fr: Attention : une réindexation complète doit être réalisée si la propriété change.

source: Labels for the four levels for mode property/level
fr: Libellés des quatre niveaux pour le mode propriété/niveau

source: Data type to use for the level
fr: Type de données à utiliser pour le niveau

source: A data type like "literal" (default) or "customvocab:X" (recommended), where X is the custom vocab id to set. This value is used for batch processes.
fr: Un type de donnée comme « literal » (défaut) ou « customvocab:X » (recommandé), où X est l’id du vocabulaire personnalisé à définir. Cette valeur est utilisée pour les traitements en lot.

source: Set property to use for embargo start
fr: Propriété pour le début de l’embargo

source: Set property to use for embargo end
fr: Propriété pour la fin de l’embargo

source: Show the access status in advanced tab of resource form when properties are used
fr: Afficher le statut d’accès dans l’onglet avancé du formulaire des ressources lorsque des propriétés sont utilisées

source: Bypass embargo dates for reserved resources
fr: Ne pas tenir compte de l’embargo pour les ressources à accès réservé

source: Update access level when embargo ends
fr: Mettre à jour le niveau d’accès quand l’embargo se termine

source: Set access level to "free"
fr: Définir le niveau d’accès à « libre »

source: Set access level to the level under ("free" for reserved, "reserved" for protected/forbidden)
fr: Définir le niveau d’accès au niveau inférieur (« libre » pour réservé, « réservé » pour protégé/interdit)

source: Keep access level
fr: Conserver le niveau d’accès

source: Update embargo dates when embargo ends
fr: Mettre à jour les dates d’embargo quand l’embargo se termine

source: Remove embargo dates
fr: Supprimer les dates d’embargo

source: Keep embargo dates
fr: Conserver les dates d’embargo

source: Process reindexation
fr: Lancer la réindexation

source: Process
fr: Traitement

source: New level
fr: Nouveau niveau

source: No change
fr: Pas de changement

source: Set date below
fr: Fixer la date ci-dessous

source: Embargo start date
fr: Date de début de l’embargo

source: Embargo end date
fr: Date de fin de l’embargo

source: Apply access level and embargo to items and medias
fr: Appliquer des niveaux d’accès et des embargos aux contenus et aux médias

source: Apply access level and embargo to medias
fr: Appliquer un niveau d’accès et un embargo aux médias

source: New
fr: Nouveau

source: Renew
fr: Renouveler

source: Accepted
fr: Accepté

source: Rejected
fr: Rejeté

source: Include medias
fr: Inclure les médias

source: Include items and medias
fr: Inclure les contenus et les médias

source: Include items and media
fr: Inclure les contenus et les médias

source: Or email
fr: Ou mail

source: Or token
fr: Ou jeton

source: value
fr: valeur

source: Start date
fr: Date de début

source: End date
fr: Date de fin

source: Add access
fr: Ajouter un accès

source: Label for the consent checkbox
fr: Libellé pour la case à cocher du consentement

source: Other fields
fr: Autres champs

source: Set the name (ascii only and no space) and the label separated by a "=", one by line. The elements may be adapted via the theme.
fr: Indiquer le nom (ascii et sans espace) et le libellé séparés par un « = », un par ligne. Les éléments peuvent être adaptés via le thème.

source: phone = Phone
fr: telephone = Téléphone

source: Send
fr: Envoyer

source: The requested resources must be an array
fr: Les ressources demandées doivent être un tableau

source: The requested resources cannot be empty.
fr: Il convient de demander au moins une ressource.

source: The status must be one of the list of statuses.
fr: Le statut doit faire partie de la liste des statuts.

source: At least one resource must be requested.
fr: Au moins une ressource doit être demandée.

source: new
fr: nouveau

source: renew
fr: renouveler

source: accepted
fr: accepté

source: rejected
fr: rejeté

source: access
fr: accès

source: request
fr: demande

source: Is under embargo
fr: Est sous embargo

source: Embargo date
fr: Date de l’embargo

source: Individual access modes (single user, email, token) are not enabled.
fr: Les demandes d’accès individuel (utilisateur simple, mail, jeton) ne sont pas activées.

source: Access request record with id #{access_request_id} does not exist
fr: La demande d’accès pour l’identifiant #{access_request_id} n’existe pas

source: The request was sent, but an issue occurred when sending the confirmation email.
fr: La demande a été envoyée, mais un problème est survenu lors de l’envoi du mail de confirmation.

source: Access request successfully updated.
fr: Demande d’accès mise à jour avec succès.

source: access request
fr: demande d’accès

source: Access request successfully deleted
fr: Demande d’accès supprimée avec succès

source: Method should be post.
fr: La méthode doit être un Post.

source: The request #{access_request_id} is invalid or unavailable.
fr: La demande #{access_request_id} est incorrecte ou indisponible.

source: The file {file} (derivative: {derivative}) is invalid or not available.
fr: Le fichier {file} {dérivé : {derivative}) est incorrect ou indisponible.

source: The user #{user_id} ({user_email}) has no rights to get the file {file} or the file is invalid.
fr: L’utilisateur #{user_id} ({user_email}) n’a pas les droits pour lire le fichier {file} ou le fichier est incorrect.

source: The visitor has no rights to get the file {file} or the file is invalid.
fr: Le visiteur n’a pas le droit de lire le fichier {file} ou le fichier est invalide.

source: Individual access requests are not allowed.
fr: Les demandes d’accès individuel ne sont pas autorisées.

source: No resources were requested.
fr: Aucune ressource n’a été demandée.

source: An email is required.
fr: Un courriel est requis.

source: A valid email is required.
fr: Un courriel valide est requis.

source: An error occurred when saving message.
fr: Il y a eu une erreur lors de l’enregistrement du message.

source: The request was submitted successfully.
fr: La demande a été envoyée avec succès.

source: Access request form
fr: Formulaire de demandes d’accès

source: Access request text
fr: Texte pour les demandes d’accès

source: Access request
fr: Demande d’accès

source: To append fields, each row must contain a name and a label separated by a "=".
fr: Pour ajouter des champs, chaque ligne doit contenir un nom et un libellé séparés par un « = ».

source: Accesses
fr: Accès

source: The resource or the access doesn’t exist.
fr: La ressource ou l’accès n’existe pas.

source: New request status!
fr: Nouveau statut de demande !

source: A user or visitor requested to access resource {resource}. Please, check request dashboard.
fr: Un utilisateur ou un visiteur a demandé un accès à la ressource {resource}. Merci de vérifier le tableau de bord.

source: A user or visitor updated the request to access a resource {resource}. Please, check request dashboard.
fr: Un utilisateur ou un visiteur a mis à jour la demande d’accès à une ressource {resource}. Merci de consulter la liste des demandes.

source: Your request to access resource {resource} is sent to administrator. You will be informed soon about it.
fr: Votre demande pour accéder à la ressource {resource} a été envoyée à l’administrateur. Nous vous répondrons très bientôt.

source: Your request to access resource {resource} was accepted.
fr: Votre demande d’accès à la ressource {resource} a été acceptée.

source: Your request to access resource {resource} was rejected.
fr: Votre demande d’accès à la ressource {resource} a été rejetée.

source: Your request to access resource {resource} is sent to administrator. You will be inform when your request will change.
fr: Votre demande pour accéder à la ressource {resource} a été envoyée à l’administrateur. Vous serez informé quand elle sera prise en compte.

source: Your request to access resource {resource} was accepted. You will be able to access it after clicking {session_url}.
fr: Votre demande d’accès à la ressource {resource} a été acceptée. Vous pouvez y accéder via l’url {session_url}.

source: This resource is not available for now. Contact the webmaster.
fr: Cette ressource n’est pas disponible pour le moment. Contacter le webmaster.

source: By submitting this form, I accept the policy for processing my personal data.
fr: En soumettant ce formulaire, j’accepte la politique de traitement de mes données personnelles.
