Repository: Daniel-KM/Omeka-S-module-Access
Catalog: language/*.po
Languages: fr

source: This module requires module %1$s version %2$s or greater.
fr: Ce module requiert le module %1$s version %2$s or greater.

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: Missing requirement. Unable to upgrade.
fr: Pré-requis manquants. Impossible de mettre à jour.

source: To be automatically upgraded and replaced by this module, the module "Access Resource" should be upgraded first to version 3.4.17.1. Else uninstall it first, but you will lose access statuses and requests.
fr: Pour être automatiquement mis à niveau et remplacé par ce module, le module « Access Resource » doit d’abord être mis à niveau à la version 3.4.17.1. Il est aussi possible de le désinstaller, mais vous perdrez les statuts d’accès et les demandes.

source: To be automatically upgraded and replaced by this module, the module "Access Resource" should be downgraded first to version 3.4.17.1. Else uninstall it first, but you will lose access statuses and requests.
fr: Pour être automatiquement mis à niveau et remplacé par ce module, le module « Access Resource » doit d’abord être rétrogradé à la version 3.4.17.1. Il est aussi possible de le désinstaller, mais vous perdrez les statuts d’accès et les demandes.

source: When properties are used, three properties should be defined for "level", "embargo start" and "embargo end".
fr: Lorsque des propriétés sont utilisées, trois propriétés doivent être définies pour le « niveau », le « début de l’embargo » et la « fin de l’embargo ».

source: Job is not launched: no option was set.
fr: La tâche n’est pas lancée : aucune option n’a été définie.

source: Access
fr: Accès

source: Access requests
fr: Demandes d’accès

source: Request #%d
fr: Demande #%d

source: User: %s
fr: Utilisateur : %s

source: Visitor: %s
fr: Visiteur : %s

source: Token: %s
fr: Jeton : %s

source: Undefined
fr: Indéfini

source: from %s
fr: de %s

source: until %s
fr: jusqu’à %s

source: from %1$s until %2$s
fr: de %1$s à %2$s

source: Full access is not supported currently
fr: L’accès complet n’est pas possible actuellement

source: Append a form to allow visitors to access request to a resource. The id of the resource should be passed as url argument.
fr: Ajoute un formulaire pour que les visiteurs demandent l’accès à une ressource. L’id de la ressource doit être passée en tant qu’argument url.

source: Logs
fr: Journaux

source: Record Id
fr: Id de la ressource

source: [no user]
fr: [pas d’utilisateur]

source: No access records yet.
fr: Aucun enregistrement d’accès.

source: Refresh page
fr: Rafraîchir la page

source: Requests
fr: Demandes

source: Add new request
fr: Ajouter une nouvelle demande

source: Requester
fr: Demandeur

source: Recursive
fr: Récursif

source: Delete access requests
fr: Supprimer les demandes d’accès

source: Are you sure you would like to delete the selected access requests?
fr: Êtes-vous sûr de vouloir supprimer les demandes d’accès sélectionnées ?

source: %1$s: this action will permanently delete %2$s access requests and cannot be undone.
fr: %1$s : cette action supprimera définitivement %2$s demandes d’accès et ne peut pas être annulée.

source: Are you sure you would like to delete all access requests on all pages of this result?
fr: Êtes-vous sûr de vouloir supprimer toutes les demandes d’accès sur toutes les pages de ce résultat ?

source: No access requests.
fr: Aucune demande d’accès.

source: New access request
fr: Nouvelle demande d’accès

source: Fields
fr: Champs

source: Edit access request
fr: Modifier la demande d’accès

source: No access requests yet.
fr: Aucune demande d’accès actuellement.

source: You already have access to the resource. Go back to the previous page to see it.
fr: Vous avez déjà accès à cette ressource. Revenez à la page précédente pour la voir.

source: To request access please %1$slogin%2$s or contact the publisher!
fr: Pour demander un accès, merci de %1$sse connecter%2$s ou de contacter l’administrateur !

source: To request access please %1$slogin%3$s or %2$sregister%3$s!
fr: Pour demander un accès, merci de %1$sse connecter%3$s ou de %2$ss’inscrire%3$s !

source: Give access
fr: Donner l’accès

source: Free access
fr: Accès libre

source: Forbidden access
fr: Accès interdit

source: Access settings don't allow individual requests.
fr: Les paramètres d’accès n’autorisent pas les demandes individuelles.

source: The access to this item is free, so the request should include medias.
fr: L’accès à ce contenu est libre, la demande doit donc inclure les médias.

source: The access to this item set is free, so the request should include items and medias.
fr: L’accès à cette collection est libre, la demande doit donc inclure les contenus et les médias.

source: There are no requests for this resource.
fr: Aucune demande pour cette ressource.

source: Enable or disable
fr: Activer ou désactiver

source: Remove request
fr: Supprimer la demande

source: Request access
fr: Demande d’accès

source: Access status
fr: Statut d’accès

source: Access Forbidden
fr: Accès interdit

source: Dashboard
fr: Tableau de bord

source: The module "%1$s" was upgraded by module "%2$s" and uninstalled.
fr: Le module « %1$s » a été mis à niveau par le module « %2$s » et désinstallé.

source: The vocabulary "{vocabulary}" was updated successfully.
fr: Le vocabulaire « {vocabulary} » a été correctement mis à jour.

source: It is now possible to add a page block to request an access.
fr: Il est désormais possible d’ajouter un bloc pour demander un accès.

source: New messages were added to make a distinction between user/visitor and accepted/rejected. Check main settings to adapt them.
fr: De nouveaux messages ont été ajoutés pour distinguer utilisateur/visiteur et accepté/rejeté. Vérifiez-les dans les paramètres généraux.

source: The module manages now http requests "Content Range" that allow to read files faster.
fr: Le module gère désormais les requêtes http de type « Content Range » qui permettent de lire les fichiers plus rapidement.

source: A new access mode allows to limit access to medias to users with a specific email via regex.
fr: Un nouveau mode d’accès permet de limiter l’accès aux utilisateurs avec une adresse mail spécifique, via regex.

source: The settings "heading" was removed from block Access request. New blocks "Heading" or "Html" were prepended to all blocks that had a filled heading. You may check pages for styles: {json}
fr: Le paramètre « titre » (heading) a été supprimé du bloc Demande d’accès. Le nouveau bloc « Titre » (Heading) ou « Html » a été ajouté avec le précédent contenu. Vous pouvez vérifier les pages pour les styles : {json}

source: The setting "template" was moved to the new block layout settings available since Omeka S v4.1. You may check pages for styles: {json}
fr: Le paramètre « template » a été déplacé dans les nouveaux paramètres de bloc depuis Omeka S v4.1. Vous pouvez vérifier les pages pour les styles : {json}

source: The template files for the block Access request should be moved from "view/common/block-layout" to "view/common/block-template" in your themes. You may check your themes for pages: {json}
fr: Les gabarits pour le bloc Demande d’accès doivent être déplacés de « view/common/block-layout » vers « view/common/block-template » dans vos thèmes. Vous pouvez vérifier les pages : {json}

source: It is now possible to define accesses by sso idps and item sets.
fr: Il est désormais possible de définir des accès par idp sso et par collections.

source: It is now possible to define excluded item sets for accesses by ip and sso idp.
fr: Il est désormais possible de définir des collections exclues pour les accès par ip et par idp sso.

source: When no time is set to an date of end of embargo, the check is now done against 23:59:59 and no more 00:00:00.
fr: Quand aucune date n’est définie pour la fin d’un embargo, la vérification est faîte sur 23:59:59 et non plus sur 00:00:00.

source: A new option allows to update the status level and to remove the embargo metadata when it ends. Default option is to keep them.
fr: Une nouvelle option permet de mettre à jour le niveau d’accès et de supprimer les données d’embargo lorsqu’il se termine. La valeur par défaut est de les conserver.

source: A job is run once a day to update accesses when embargo ends.
fr: Une tâche est lancée une fois par jour pour mettre à jour les niveaux d’accès des ressources dont l’embargo se termine.

source: The three criteria to access a media are now fully independant: visibility of item and media should be public; access level should be free (or reserved for authorized users); resource should not be under embargo.
fr: Les trois critères pour accéder à un média sont désormais totalement indépendants : la visibilité du contenu et du média doivent être publics ; le niveau d’accès doit être libre (ou réservé pour les utilisateurs autorisés) ; la ressource ne doit pas être sous embargo.

source: The .htaccess rule is managed by the module and protects file types: {types}.
fr: La règle .htaccess est gérée par le module et protège les types de fichiers : {types}.

source: A legacy .htaccess rule was detected for file types: {types}. It is recommended to open the module configuration form and save it to convert the rule to the managed format.
fr: Une règle .htaccess héritée a été détectée pour les types de fichiers : {types}. Il est recommandé d'ouvrir le formulaire de configuration du module et de l'enregistrer pour convertir la règle au format géré.

source: The .htaccess rule is not yet set. Open the module configuration form to manage it. Default file types: {types}.
fr: La règle .htaccess n'est pas encore définie. Ouvrez le formulaire de configuration du module pour la gérer. Types de fichiers par défaut : {types}.

source: The module {module} should be upgraded to version {version} or later.
fr: Le module {module} doit être mis à niveau à la version {version} ou supérieure.

source: The key "accessresource" in the file config/local.config.php at the root of Omeka can be removed.
fr: L’index « accessresource » dans le fichier config/local.config.php à la racine d’Omeka peut être supprimé.

source: Access module: the .htaccess is not writable; the rewrite rule was not removed during uninstall.
fr: Module d'accès : le fichier .htaccess n'est pas accessible en écriture ; la règle de réécriture n'a pas été supprimée lors de la désinstallation.

source: The Access rule has been converted to an Analytics download rule for file types: {types}.
fr: La règle d'accès a été convertie en règle de téléchargement de statistiques pour les types de fichiers : {types}.

source: An error occurred during migration of module "{module}". Check the config and uninstall it manually.
fr: Une erreur est survenue pendant la migration du module « {module} ». Vérifier la config et désinstaller le manuellement.

source: This module cannot install its tables, because they exist already. Try to remove them first.
fr: Ce module ne peut pas installer ses tables car elles existent déjà. Essayez de les supprimer manuellement.

source: It is recommended to run the job in config form to initialize all access statuses.
fr: Il est recommandé de lancer la tâche dans la configuration pour initialiser tous les statuts d'accès.

source: Cleaned params used for Access: {json}
fr: Paramètres utilisés pour le module Access : {json}

source: The access level of the item #{item_id} is different from access level for medias {media_ids}. Update them if needed in tab "advanced".
fr: Le niveau d’accès du contenu #{item_id} est différent du niveau d’accès pour les médias {media_ids}. Mettez-les à jour si besoin dans l’onglet « Avancé ».

source: You should set either a user or an email or check box for token.
fr: Vous devez définir un utilisateur, un courriel ou un jeton.

source: Access request successfully created.
fr: Demande d’accès créée avec succès.

source: Free
fr: Libre

source: Reserved
fr: Réservé

source: Protected
fr: Protégé

source: Access level
fr: Niveau d’accès

source: Embargo start
fr: Début de l’embargo

source: Embargo end
fr: Fin de l’embargo

source: Access level (managed via property %s)
fr: Niveau d’accès (géré par la propriété %s)

source: Embargo start (managed via property %s)
fr: Début de l’embargo (géré par la propriété %s)

source: Embargo end (managed via property %s)
fr: Fin de l’embargo (géré par la propriété %s)

source: Copy access level and embargo to items and medias
fr: Copier le niveau d’accès et les dates d’embargo dans les contenus et les médias

source: Copy access level and embargo to medias
fr: Copier le niveau d’accès et les dates d’embargo dans les médias

source: New medias only
fr: Seulement les nouveau médias

source: All medias
fr: Tous les médias

source: Access: Reindex resources
fr: Accès : Réindexer les ressources

source: Options to reindex accesses
fr: Options pour réindexer les accès

source: The file .htaccess is not readable at the root of Omeka.
fr: Le fichier .htaccess n'est pas lisible à la racine d'Omeka.

source: A legacy .htaccess rule protects file types "{types}" but is not managed by the module. Save the configuration to convert it to the managed format.
fr: Une règle .htaccess héritée protège les types de fichiers "{types}" mais n'est pas gérée par le module. Enregistrez la configuration pour la convertir au format géré.

source: No .htaccess rule is set to protect files. To control access to files, add the following lines in the file .htaccess at the root of Omeka, just after "RewriteEngine On":{line_break}{rule}
fr: Aucune règle .htaccess n'est définie pour protéger les fichiers. Pour contrôler l'accès aux fichiers, ajoutez les lignes suivantes dans le fichier .htaccess à la racine d'Omeka, juste après "RewriteEngine On":{line_break}{rule}

source: The file .htaccess is not writable. Add the following lines manually in the file .htaccess at the root of Omeka, just after "RewriteEngine On":{line_break}{rule}
fr: Le fichier .htaccess n'est pas accessible en écriture. Ajoutez manuellement les lignes suivantes dans le fichier .htaccess à la racine d'Omeka, juste après "RewriteEngine On":{line_break}{rule}

source: The file .htaccess is not writable. Remove the lines starting with "{marker}" manually from the file .htaccess at the root of Omeka.
fr: Le fichier .htaccess n'est pas accessible en écriture. Supprimez manuellement les lignes commençant par "{marker}" du fichier .htaccess à la racine d'Omeka.

source: The .htaccess rule has been updated to protect file types: {types}.
fr: La règle .htaccess a été mise à jour pour protéger les types de fichiers : {types}.

source: The .htaccess rule for file protection has been removed.
fr: La règle .htaccess pour la protection des fichiers a été supprimée.

source: According to setting, when embargo ends, the access level is set to "free" and the embargo dates are cleared.
fr: Conformément aux paramètres, lorsqu’un embargo se termine, le niveau d’accès devient « libre » et les dates d’embargo sont supprimées.

source: According to setting, when embargo ends, the access level is set to "free" and the embargo dates are kept.
fr: Conformément aux paramètres, lorsqu’un embargo se termine, le niveau d’accès devient « libre » et les dates d’embargo sont conservées.

source: According to setting, when embargo ends, the access level is set to the level under ("free" for reserved, "reserved" for protected/forbidden) and the embargo dates are cleared.
fr: Conformément aux paramètres, lorsqu’un embargo se termine, le niveau d’accès devient le niveau inférieur (« libre » pour réservé, « réservé » pour protégé/interdit) et les dates d’embargo sont supprimées.

source: According to setting, when embargo ends, the access level is set to the level under ("free" for reserved, "reserved" for protected/forbidden) and the embargo dates are kept.
fr: Conformément aux paramètres, lorsqu’un embargo se termine, le niveau d’accès devient le niveau inférieur (« libre » pour réservé, « réservé » pour protégé/interdit) et les dates d’embargo sont conservées.

source: According to setting, when embargo ends, the access level is kept and the embargo dates are cleared.
fr: Conformément aux paramètres, lorsqu’un embargo se termine, le niveau d’accès est conservé et les dates d’embargo sont supprimées.

source: According to setting, when embargo ends, the access level and the embargo dates are kept.
fr: Conformément aux paramètres, lorsqu’un embargo se termine, le niveau d’accès et les dates d’embargo sont conservés.

source: A job was launched in background to update access statuses according to parameters: ({link_job}job #{job_id}{link_end}, {link_log}logs{link_end}).
fr: Une tâche a été lancée en arrière-plan pour mettre à jour les statuts d’accès selon les paramètres : ({link_job}tâche #{job_id}{link_end}, {link_log}journaux{link_end}).

source: The ip "{ip}" is empty or invalid.
fr: L’ip « {ip} » est vide ou incorrecte.

source: The item sets list "{input}" for ip {ip} is invalid: they should be numeric ids, optionaly prepended with a "-".
fr: La liste des collections « {input} » pour l’ip « {ip} » est incorrecte : ce doit être des numéros, éventuellement préfixés de « - ».

source: The item sets list "{input}" for ip {ip} contains duplicate item sets ({list}).
fr: La liste des collections « {input} » pour l’ip « {ip} » contient des collections inconnues ({list}).

source: The item sets list "{input}" for ip {ip} contains unknown item sets ({list}).
fr: La liste des collections « {input} » pour l’ip « {ip} » contient des collections inconnues ({list}).

source: No idps are defined. Check the config of module Single Sign-On first.
fr: Aucune idp n’est définie. Vérifiez la configuration du module Single Sign-On d’abord.

source: The idp "{idp}" is empty or not defined in module Single Sign-On.
fr: L’idp « {idp} » est vide ou non défini par le module Single Sign-On.

source: The item sets list "{input}" for idp {idp} is invalid: they should be numeric ids, optionaly prepended with a "-".
fr: La liste des collections « {input} » pour l’idp « {idp} » est incorrecte : ce doit être des numéros, éventuellement préfixés de « - ».

source: The item sets list "{input}" for idp {idp} contains duplicate item sets ({list}).
fr: La liste des collections « {input} » pour l’idp « {idp} » contient des collections inconnues ({list}).

source: The item sets list "{input}" for idp {idp} contains unknown item sets ({list}).
fr: La liste des collections « {input} » pour l’idp « {idp} » contient des collections inconnues ({list}).

source: Sync mode {mode} is invalid.
fr: Le mode de synchronisation {mode} est incorrect.

source: Missing mode {mode} is invalid.
fr: Le mode manquant {mode} n’est pas valide.

source: These recursive processes are unknown: {names}.
fr: Ces processus récursifs sont inconnus : {names}.

source: Synchronization and missing modes are set as "skip" and no recursive processes are set.
fr: Les modes de synchronisation et d’absence sont définis comme « ignorer » et aucun processus récursif n’est défini.

source: Synchronization of property values and index is set, but the config for access mode does not use properties.
fr: La synchronisation des valeurs des propriétés et de l’index est activée, mais la configuration du mode d’accès n’utilise pas les propriétés.

source: Starting indexation of access statuses of all resources.
fr: Lancement de l’indexation des statuts d’accès de toutes les ressources.

source: End of indexation.
fr: Fin de l’indexation.

source: No resource to process.
fr: Aucune ressource à traiter.

source: End of indexation of access statuses in properties.
fr: Fin de l’indexation des statuts d’accès dans les propriétés.

source: No resource "{resource_id}" to process.
fr: Pas de ressource « {resource_id} » à traiter.

source: Resource #{resource_id} is not an item or an item set.
fr: La ressource #{resource_id} n’est pas un contenu ou une collection.

source: No access status for resource #{resource_id}.
fr: Aucun statut d’accès pour la ressource #{resource_id}.

source: Skipping process according to the option defined.
fr: Traitement ignoré conformément au paramètre.

source: There is no resource with an embargo.
fr: Aucune ressource n’a d’embargo.

source: There is no resource with an embargo to update.
fr: Aucune ressource n’a un embargo à mettre à jour.

source: Applying level "free" and clear embargo date for {count}/{total} resources with an embargo that ended.
fr: Application du niveau « libre » et suppression des dates d’embargo pour {count}/{total} ressources avec un embargo qui s’est terminé.

source: Applying level "free" for {count}/{total} resources with an embargo that ended.
fr: Application du niveau « libre » pour {count}/{total} ressources avec un embargo qui s’est terminé.

source: Applying level under and clear embargo date for {count}/{total} resources with an embargo that ended.
fr: Application du niveau inférieur et suppression des dates d’embargo pour {count}/{total} ressources avec un embargo qui s’est terminé.

source: Applying level under for {count}/{total} resources with an embargo that ended.
fr: Application du niveau inférieur pour {count}/{total} ressources avec un embargo qui s’est terminé.

source: Clearing embargo dates for {count}/{total} resources with an embargo that ended.
fr: Supprimer les dates d’embargo pour {count}/{total} ressources avec un embargo qui s’est terminé.

source: Property {property} for level does not exist.
fr: La propriété {property} pour le niveau n’existe pas.

source: Property to set access level is not defined.
fr: La propriété permettant de définir le niveau d’accès n’est pas définie.

source: Property {property} for embargo start does not exist.
fr: La propriété {property} pour le début de l’embargo n’existe pas.

source: Property to set embargo start is not defined.
fr: La propriété permettant de définir le début de l’embargo n’est pas définie.

source: Property {property} for embargo end does not exist.
fr: La propriété {property} pour la fin de l’embargo n’existe pas.

source: Property to set embargo end is not defined.
fr: La propriété permettant de définir la fin de l’embargo n’est pas définie.

source: List of property levels is incomplete, missing {strings}.
fr: La liste des niveaux pour la propriété est incomplète, il manque {strings}.

source: The data type for property level is not set, so {data_type} will be used by default when it is not set in metadata.
fr: Le type de données pour la propriété pour le niveau n’est pas défini. « {data_type} » sera utilisé par défaut s’il n’est pas défini dans les métadonnées.

source: Jobs to create missing access status of all resources
fr: Tâches pour créer les statuts d’accès manquants pour toutes les ressources

source: Copy level and embargo
fr: Copier le niveau et l’embargo

source: From item sets to items and medias
fr: Des collections aux contenus et aux médias

source: From items to medias
fr: Des contenus aux médias

source: Copy access level and embargo
fr: Copier le niveau d’accès et l’embargo

source: Skip
fr: Ignorer

source: Copy data from property values into indexes
fr: Copier les données des valeurs des propriétés dans les index

source: Copy data from indexes into property values
fr: Copier les données des index dans les valeurs des propriétés

source: Fill missing statuses
fr: Remplir les statuts manquants

source: Set access level free for all resources without status
fr: Définir un niveau d’accès libre pour toutes les ressources sans statut

source: Set access level reserved for all resources without status
fr: Définir le niveau d’accès réservé pour toutes les ressources sans statut
